app/controllers/users_controller.rb

  def create
    # @user = User.new(username: params[:username], email: params[:email], password: params[:password])
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("username", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "asdasd"], ["email", "kblycaglayan@gmail.com"], ["password", "asdasd"], ["created_at", "2020-05-05 15:38:08.939109"], ["updated_at", "2020-05-05 15:38:08.939109"]]

  def update
    @user = User.find(params[:id])

    if @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "username" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "example1"], ["updated_at", "2020-05-06 08:32:24.341524"], ["id", 5]]